Coding/Cpp/template.html
<?xml version="1.0" encoding="gb18030"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="zh-CN" xml:lang="zh-CN">
<head>
<title>C++模板</title>
<meta http-equiv="Content-Type" content="text/html;charset=gb18030"/>
<meta name="title" content="C++模板"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2012-12-14 09:03:12 CST"/>
<meta name="author" content="visayafan"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<div id="org-div-comments"><a href="../../index.html#cpp">主页</a></div>


</head>
<body>


<div id="content">
<h1 class="title">C++模板</h1>


<!-- <script type="text/javascript" src="https://ajax.googleapis.com/ajax/libs/jquery/1.7.1/jquery.min.js"> </script> -->
<link rel="stylesheet" type="text/css" href="../../Layout/CSS/bootstrap_old.css" />
<link rel="stylesheet" type="text/css" href="../../Layout/CSS/style.css" />
<script src="../../Layout/JS/jquery_1.7.1.js"></script>
<script src="../../Layout/JS/bootstrap_old.js"></script>


<div id="table-of-contents">
<h2>目录</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 术语</a>
<ul>
<li><a href="#sec-1-1">1.1 type parameter</a></li>
<li><a href="#sec-1-2">1.2 instantiation</a></li>
<li><a href="#sec-1-3">1.3 template argument</a></li>
<li><a href="#sec-1-4">1.4 call argument</a></li>
</ul>
</li>
<li><a href="#sec-2">2 注意</a></li>
<li><a href="#sec-3">3 特化与偏特化</a></li>
<li><a href="#sec-4">4 默认模板参数(default template argument)</a></li>
<li><a href="#sec-5">5 无类型模板参数</a></li>
<li><a href="#sec-6">6 const函数</a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> 术语</h2>
<div class="outline-text-2" id="text-1">


</div>

<div id="outline-container-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> type parameter</h3>
<div class="outline-text-3" id="text-1-1">

<p>   类型参数(STL源码剖析中翻译为型别参数)<br/>
   template &lt;typename T&gt; 其中T就是type parameter<br/>
</p>
</div>

</div>

<div id="outline-container-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> instantiation</h3>
<div class="outline-text-3" id="text-1-2">

<p>   实例化<br/>
   用一具体的参数代替类型参数叫instantiation<br/>
</p></div>

</div>

<div id="outline-container-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> template argument</h3>
<div class="outline-text-3" id="text-1-3">

<p>   模板参数 就是用typename声明的参数<br/>
</p></div>

</div>

<div id="outline-container-1-4" class="outline-3">
<h3 id="sec-1-4"><span class="section-number-3">1.4</span> call argument</h3>
<div class="outline-text-3" id="text-1-4">

<p>   调用参数 实际调用中向其传递的参数<br/>
</p>
</div>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> 注意</h2>
<div class="outline-text-2" id="text-2">

<ol>
<li>模板不支持automatic type conversion自动类型转换<br/>
</li>
<li>类成员函数要等调用的时候才实例化<br/>
     Note that code is instantiated only for member functions that are called.<br/>
     For class templates, member functions are instantiated only when they are used. <br/>
<ul>
<li>省时省空间<br/>
</li>
<li>you can instantiate a class even for those types that cannot perform all the operations of all the member functions, as long as these member functions are not called.<br/>
      你可以用一此类型实例化一个类，即使这个类型不能满足所有的成员函数的所有操作要求（只要不调用这个成员函数就可以了）。<br/>
</li>
</ul>

</li>
<li>静态成员被实例化时每种类型只调用一次<br/>
</li>
</ol>

</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> 特化与偏特化</h2>
<div class="outline-text-2" id="text-3">

<ol>
<li>specialization<br/>
</li>
</ol>




<pre class="src src-c++"><span style="color: #a020f0;">template</span> &lt;&gt;
<span style="color: #a020f0;">class</span>&lt;<span style="color: #008b8b;">std</span>::<span style="color: #228b22;">string</span>&gt; <span style="color: #228b22;">Queue</span>{
<span style="color: #a020f0;">public</span>:
    <span style="color: #228b22;">void</span> <span style="color: #0000ff;">push</span>(<span style="color: #a020f0;">const</span> <span style="color: #008b8b;">std</span>::<span style="color: #228b22;">string</span>&amp;);
    <span style="color: #b22222;">//</span><span style="color: #b22222;">....</span>
}
<span style="color: #228b22;">void</span> <span style="color: #008b8b;">Queue</span>&lt;<span style="color: #008b8b;">std</span>::<span style="color: #228b22;">string</span>&gt;::<span style="color: #0000ff;">push</span>(<span style="color: #a020f0;">const</span> <span style="color: #008b8b;">std</span>::<span style="color: #228b22;">string</span>&amp;){
    <span style="color: #b22222;">//</span><span style="color: #b22222;">....</span>
}
</pre>

<ol>
<li>partial specialization <br/>
</li>
</ol>




<pre class="src src-c++"><span style="color: #a020f0;">template</span> &lt;<span style="color: #a020f0;">typename</span> <span style="color: #228b22;">T1</span>, <span style="color: #a020f0;">typename</span> <span style="color: #228b22;">T2</span>&gt;
<span style="color: #a020f0;">class</span> <span style="color: #228b22;">A</span>{                        <span style="color: #b22222;">// </span><span style="color: #b22222;">&#26080;&#20559;&#29305;&#21270;&#30340;&#27491;&#24120;&#27169;&#26495;&#31867;</span>
    <span style="color: #b22222;">//</span><span style="color: #b22222;">....</span>
};

<span style="color: #a020f0;">template</span> &lt;<span style="color: #a020f0;">typename</span> <span style="color: #228b22;">T</span>&gt;
<span style="color: #a020f0;">class</span> <span style="color: #228b22;">A</span>&lt;<span style="color: #228b22;">T</span>, <span style="color: #228b22;">T</span>&gt;{                  <span style="color: #b22222;">// </span><span style="color: #b22222;">&#20559;&#29305;&#21270;&#65292;&#20004;&#20010;&#21442;&#25968;&#19968;&#26679;</span>
    <span style="color: #b22222;">//</span><span style="color: #b22222;">....</span>
};

<span style="color: #a020f0;">template</span> &lt;<span style="color: #a020f0;">typename</span> <span style="color: #228b22;">T</span>&gt;
<span style="color: #a020f0;">class</span> <span style="color: #228b22;">A</span>&lt;<span style="color: #228b22;">T</span>, <span style="color: #228b22;">int</span>&gt;{                <span style="color: #b22222;">// </span><span style="color: #b22222;">&#20559;&#29305;&#21270;&#65292;&#20854;&#20013;&#19968;&#20010;&#21442;&#25968;&#20026;int&#22411;</span>
    <span style="color: #b22222;">//</span><span style="color: #b22222;">....</span>
};

<span style="color: #a020f0;">template</span> &lt;<span style="color: #a020f0;">typename</span> <span style="color: #228b22;">T1</span>, <span style="color: #a020f0;">typename</span> <span style="color: #228b22;">T2</span>&gt;
<span style="color: #a020f0;">class</span> <span style="color: #228b22;">A</span>&lt;<span style="color: #228b22;">T1</span>*, <span style="color: #228b22;">T2</span>*&gt;{              <span style="color: #b22222;">// </span><span style="color: #b22222;">&#20559;&#29305;&#21270;&#65292;&#20004;&#20010;&#27169;&#26495;&#21442;&#25968;&#37117;&#26159;&#25351;&#38024;&#31867;&#22411;</span>
    <span style="color: #b22222;">//</span><span style="color: #b22222;">....</span>
};
</pre>

<p>
     则：<br/>
</p>


<pre class="src src-c++">&#21017;&#65306;
<span style="color: #228b22;">MyClass</span>&lt;<span style="color: #228b22;">int</span>,<span style="color: #228b22;">float</span>&gt; mif;    <span style="color: #b22222;">// </span><span style="color: #b22222;">uses MyClass&lt;T1,T2&gt; </span>
<span style="color: #228b22;">MyClass</span>&lt;<span style="color: #228b22;">float</span>,<span style="color: #228b22;">float</span>&gt; <span style="color: #a0522d;">mff</span>;  <span style="color: #b22222;">// </span><span style="color: #b22222;">uses MyClass&lt;T,T&gt; </span>
<span style="color: #228b22;">MyClass</span>&lt;<span style="color: #228b22;">float</span>,<span style="color: #228b22;">int</span>&gt; <span style="color: #a0522d;">mfi</span>;    <span style="color: #b22222;">// </span><span style="color: #b22222;">uses MyClass&lt;T,int&gt; </span>
<span style="color: #228b22;">MyClass</span>&lt;<span style="color: #228b22;">int</span>*,<span style="color: #228b22;">float</span>*&gt; <span style="color: #a0522d;">mp</span>;   <span style="color: #b22222;">// </span><span style="color: #b22222;">uses MyClass&lt;T1*,T2*&gt; </span>
</pre>

<p>
    当出现两个都匹配的偏特化类时会报错：<br/>
</p>


<pre class="src src-c++"><span style="color: #228b22;">MyClass</span>&lt;<span style="color: #228b22;">int</span>,<span style="color: #228b22;">int</span>&gt; <span style="color: #a0522d;">m</span>;        <span style="color: #b22222;">// </span><span style="color: #b22222;">ERROR: matches MyClass&lt;T,T&gt; </span>
                           <span style="color: #b22222;">//        </span><span style="color: #b22222;">and MyClass&lt;T,int&gt; </span>
<span style="color: #228b22;">MyClass</span>&lt;<span style="color: #228b22;">int</span>*,<span style="color: #228b22;">int</span>*&gt; <span style="color: #a0522d;">m</span>;      <span style="color: #b22222;">// </span><span style="color: #b22222;">ERROR: matches MyClass&lt;T,T&gt; </span>
                           <span style="color: #b22222;">//        </span><span style="color: #b22222;">and MyClass&lt;T1*,T2*&gt; </span>
</pre>

<p>
    上面第2个问题的解决可以再提供一个两个指针的偏特化类。<br/>
</p>


<pre class="src src-java">template &lt;typename T&gt;
<span style="color: #a020f0;">class</span> A&lt;T*, T*&gt;{
    <span style="color: #b22222;">//</span><span style="color: #b22222;">....</span>
};
</pre>


</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> 默认模板参数(default template argument)</h2>
<div class="outline-text-2" id="text-4">

<p>  当实例化时若没有实例化默认模板参数，则会采用默认值。<br/>
</p></div>

</div>

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> 无类型模板参数</h2>
<div class="outline-text-2" id="text-5">

<p>  没有类型只有数值的模板参数。<br/>
</p>


<pre class="src src-c++"><span style="color: #a020f0;">template</span> &lt;<span style="color: #a020f0;">typename</span> <span style="color: #228b22;">T</span>, <span style="color: #228b22;">int</span> <span style="color: #a0522d;">MAXSIZE</span> <span style="color: #b22222;">/* </span><span style="color: #b22222;">= 200 */</span>&gt;  <span style="color: #b22222;">//</span><span style="color: #b22222;">&#21516;&#29702;&#36825;&#37324;&#20063;&#21487;&#20197;&#20351;&#29992;&#40664;&#35748;&#20540;</span>
<span style="color: #a020f0;">class</span> <span style="color: #228b22;">A</span>{
<span style="color: #a020f0;">public</span>:
    <span style="color: #228b22;">T</span> <span style="color: #a0522d;">t</span>[MAXSIZE];
    <span style="color: #b22222;">//</span><span style="color: #b22222;">....</span>
};
</pre>

</div>

</div>

<div id="outline-container-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> const函数</h2>
<div class="outline-text-2" id="text-6">

<p>  STL vector重载operator[]:<br/>
</p>


<pre class="src src-c++"><span style="color: #228b22;">reference</span> <span style="color: #a020f0;">operator</span><span style="color: #0000ff;">[]</span>(<span style="color: #228b22;">size_type</span> <span style="color: #a0522d;">__n</span>) {<span style="color: #a020f0;">return</span> *(<span style="color: #a020f0;">this</span>-&gt;_M_impl._M_start + __n);}
<span style="color: #228b22;">const_reference</span> <span style="color: #a020f0;">operator</span><span style="color: #0000ff;">[]</span>(<span style="color: #228b22;">size_type</span> <span style="color: #a0522d;">__n</span>) <span style="color: #a020f0;">const</span> {<span style="color: #a020f0;">return</span> *(<span style="color: #a020f0;">this</span>-&gt;_M_impl._M_start + __n);}
</pre>

<p>
  函数末尾加上const含义是函数体不能修改成员变量。<br/>
  实际情况是隐含的this指针性质发生变化：<br/>
</p>


<pre class="src src-c++"><span style="color: #228b22;">reference</span> <span style="color: #a020f0;">operator</span><span style="color: #0000ff;">[]</span>(class_type *<span style="color: #a020f0;">this</span>, <span style="color: #228b22;">size_type</span> <span style="color: #a0522d;">n</span>);
<span style="color: #228b22;">const_reference</span> <span style="color: #a020f0;">operator</span><span style="color: #0000ff;">[]</span>(<span style="color: #a020f0;">const</span> <span style="color: #228b22;">class_type</span> *<span style="color: #a020f0;">this</span>, <span style="color: #228b22;">size_type</span> <span style="color: #a0522d;">n</span>);
</pre>

<p>
  由于this是const class_type*类型，故无法修改this指向的类对象。<br/>
</p>
<p>
  当const class调用时用的是第2个，返回是const_reference。当non-const类调用时调用第1个，返回reference.<br/>
</p></div>
</div>
</div>

</body>
</html>
